apache/nuttx/arch/arm/src/imxrt/imxrt118x_clockconfig.c
/****************************************************************************
 * arch/arm/src/imxrt/imxrt118x_clockconfig.c
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#include <errno.h>
#include <stdbool.h>
#include <stdint.h>

#include <arch/barriers.h>
#include <arch/board/board.h>
#include <nuttx/arch.h>

#include "arm_internal.h"
#include "hardware/imxrt_ccm.h"
#include "hardware/imxrt_memorymap.h"
#include "hardware/rt118x/imxrt118x_ele.h"
#include "hardware/rt118x/imxrt118x_osc.h"
#include "hardware/rt118x/imxrt118x_pll.h"
#include "hardware/rt118x/imxrt118x_pmu.h"
#include "imxrt_clockconfig.h"
#include "imxrt_periphclks.h"

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

#define IMXRT118X_RC24M_FREQUENCY       24000000u
#define IMXRT118X_RC400M_FREQUENCY      400000000u
#define IMXRT118X_XTAL_FREQUENCY        BOARD_XTAL_FREQUENCY
#define IMXRT118X_SYSPLL1_FREQUENCY     1000000000u
#define IMXRT118X_SYSPLL2_FREQUENCY     528000000u
#define IMXRT118X_SYSPLL3_FREQUENCY     480000000u
#define IMXRT118X_ELE_TIMEOUT           1000000u
#define IMXRT118X_PLL_TIMEOUT           1000000u
#define IMXRT118X_SYSPLL1_DIV           41u
#define IMXRT118X_SYSPLL1_NUMERATOR     178956970u
#define IMXRT118X_SYSPLL1_DENOMINATOR   0x0fffffffu
#define IMXRT118X_SYSPLL3_PFD3_FRAC     18u
#define IMXRT118X_PLL_REG_DELAY_US      100u
#define IMXRT118X_PLL_HOLD_DELAY_US     225u

/****************************************************************************
 * Public Data
 ****************************************************************************/

volatile uint32_t g_imxrt118x_clock_status
  __attribute__((section(".clockstatus")));
volatile int32_t g_imxrt118x_clock_error
  __attribute__((section(".clockstatus")));

/****************************************************************************
 * Private Functions
 ****************************************************************************/

static bool imxrt_wait_mask(uintptr_t address, uint32_t mask, bool set)
{
  unsigned int timeout;

  for (timeout = IMXRT118X_ELE_TIMEOUT; timeout > 0; timeout--)
    {
      if (((getreg32(address) & mask) != 0) == set)
        {
          return true;
        }
    }

  return false;
}

static int imxrt_ele_command(const uint32_t *request,
                             unsigned int request_size,
                             uint32_t expected, uint32_t *response)
{
  uint32_t header;
  unsigned int i;
  unsigned int size;

  for (i = 0; i < request_size; i++)
    {
      if (!imxrt_wait_mask(IMXRT_S3MUA_TSR, 1u << i, true))
        {
          return -ETIMEDOUT;
        }

      putreg32(request[i], IMXRT_S3MUA_TR(i));
    }

  if (!imxrt_wait_mask(IMXRT_S3MUA_RSR, 1u, true))
    {
      return -ETIMEDOUT;
    }

  header = getreg32(IMXRT_S3MUA_RR(0));
  size = (header >> 8) & 0xffu;
  if (header != expected || size < 2 || size > 4)
    {
      return -EPROTO;
    }

  response[0] = header;
  for (i = 1; i < size; i++)
    {
      if (!imxrt_wait_mask(IMXRT_S3MUA_RSR, 1u << i, true))
        {
          return -ETIMEDOUT;
        }

      response[i] = getreg32(IMXRT_S3MUA_RR(i));
    }

  return response[1] == IMXRT_ELE_RESPONSE_SUCCESS ? OK : -EACCES;
}

static int imxrt_ele_release_trdc(uint32_t resource)
{
  uint32_t request[2];
  uint32_t response[4];

  request[0] = IMXRT_ELE_RELEASE_RDC;
  request[1] = (resource << 8) | IMXRT_ELE_CORE_CM33_ID;
  return imxrt_ele_command(request, 2, IMXRT_ELE_RELEASE_RDC_RESPONSE,
                           response);
}

static int imxrt_ele_prepare_clocks(void)
{
  uint32_t request[1];
  uint32_t response[4];
  int ret;

  request[0] = IMXRT_ELE_GET_FW_STATUS;
  ret = imxrt_ele_command(request, 1, IMXRT_ELE_GET_FW_STATUS_RESPONSE,
                          response);
  if (ret < 0)
    {
      return ret;
    }

  g_imxrt118x_clock_status |= IMXRT_CLOCK_STATUS_ELE_READY;

  ret = imxrt_ele_release_trdc(IMXRT_ELE_TRDC_AON_ID);
  if (ret < 0)
    {
      return ret;
    }

  g_imxrt118x_clock_status |= IMXRT_CLOCK_STATUS_TRDC_AON;

  /* MEGA must be transferred before WAKEUP because WAKEUP controls access
   * to the MEGA TRDC.
   */

  ret = imxrt_ele_release_trdc(IMXRT_ELE_TRDC_MEGA_ID);
  if (ret < 0)
    {
      return ret;
    }

  g_imxrt118x_clock_status |= IMXRT_CLOCK_STATUS_TRDC_MEGA;

  ret = imxrt_ele_release_trdc(IMXRT_ELE_TRDC_WAKEUP_ID);
  if (ret < 0)
    {
      return ret;
    }

  g_imxrt118x_clock_status |= IMXRT_CLOCK_STATUS_TRDC_WAKEUP;
  return OK;
}

static void imxrt_delay_cycles(unsigned int cycles)
{
  volatile unsigned int count;

  for (count = cycles; count > 0; count--)
    {
      __asm__ __volatile__("nop");
    }
}

static void imxrt_clock_failure(int error) noreturn_function;
static void imxrt_clock_failure(int error)
{
  g_imxrt118x_clock_error = error;

  /* A running kernel would use the 240 MHz board timing constants.  Do not
   * continue at RC24M with incorrect scheduler and peripheral timing.
   */

