apache/nuttx/arch/arm/src/imxrt/imxrt118x_clockconfig.c
  for (; ; )
    {
      __asm__ __volatile__("nop");
    }
}

static int imxrt_syspll3_initialize(void)
{
  uint32_t reg;
  unsigned int timeout;

  reg = PHY_LDO_OUTPUT_TARGET(0x10) | PHY_LDO_ENABLE |
        PHY_LDO_CURRENT_LIMIT_ENABLE;
  putreg32(reg, IMXRT_PHY_LDO_CTRL0);
  imxrt_delay_cycles(64);
  modifyreg32(IMXRT_PHY_LDO_CTRL0, PHY_LDO_CURRENT_LIMIT_ENABLE, 0);
  g_imxrt118x_clock_status |= IMXRT_CLOCK_STATUS_PLL_LDO;

  reg = getreg32(IMXRT_ANADIG_PLL_SYS3_CTRL);
  if ((reg & PLL_SYS3_POWERUP) == 0)
    {
      putreg32(PLL_SYS3_REG_ENABLE | PLL_SYS3_GATE,
               IMXRT_ANADIG_PLL_SYS3_CTRL);
      imxrt_delay_cycles(1024);

      reg = PLL_SYS3_REG_ENABLE | PLL_SYS3_GATE | PLL_SYS3_POWERUP |
            PLL_SYS3_HOLD_RING_OFF;
      putreg32(reg, IMXRT_ANADIG_PLL_SYS3_CTRL);
      imxrt_delay_cycles(1024);

      reg &= ~PLL_SYS3_HOLD_RING_OFF;
      putreg32(reg, IMXRT_ANADIG_PLL_SYS3_CTRL);
    }

  for (timeout = IMXRT118X_PLL_TIMEOUT; timeout > 0; timeout--)
    {
      if ((getreg32(IMXRT_ANADIG_PLL_SYS3_CTRL) & PLL_SYS3_STABLE) != 0)
        {
          modifyreg32(IMXRT_ANADIG_PLL_SYS3_CTRL, PLL_SYS3_GATE,
                      PLL_SYS3_ENABLE | PLL_SYS3_DIV2_ENABLE);
          g_imxrt118x_clock_status |= IMXRT_CLOCK_STATUS_SYS_PLL3;
          return OK;
        }
    }

  return -ETIMEDOUT;
}

#define SOURCES_COMMON(a, b) \
  {IMXRT_CLK_OSC_RC24M, IMXRT_CLK_OSC_RC400M, (a), (b)}

/* The mux input ordering is root-specific.  This table is derived from the
 * RT1186 clock mux table in the NXP device SDK, not from the RT117x.
 */

static const uint8_t g_clock_sources[IMXRT_CCM_ROOT_COUNT][4] =
{
  SOURCES_COMMON(IMXRT_CLK_ARM_PLL,          IMXRT_CLK_SYS_PLL3),
  SOURCES_COMMON(IMXRT_CLK_SYS_PLL3,         IMXRT_CLK_ARM_PLL),
  SOURCES_COMMON(IMXRT_CLK_SYS_PLL1,         IMXRT_CLK_SYS_PLL2_PFD1),
  SOURCES_COMMON(IMXRT_CLK_SYS_PLL2,         IMXRT_CLK_SYS_PLL3_PFD2),
  SOURCES_COMMON(IMXRT_CLK_SYS_PLL2,         IMXRT_CLK_SYS_PLL3_PFD1),
  SOURCES_COMMON(IMXRT_CLK_SYS_PLL3,         IMXRT_CLK_SYS_PLL2_PFD1),
  SOURCES_COMMON(IMXRT_CLK_SYS_PLL3_DIV2,    IMXRT_CLK_SYS_PLL1_DIV5),
  SOURCES_COMMON(IMXRT_CLK_OSC24M,           IMXRT_CLK_SYS_PLL3_DIV2),
  SOURCES_COMMON(IMXRT_CLK_OSC24M,           IMXRT_CLK_SYS_PLL3_DIV2),
  SOURCES_COMMON(IMXRT_CLK_SYS_PLL3_DIV2,    IMXRT_CLK_SYS_PLL1_DIV5),
  SOURCES_COMMON(IMXRT_CLK_SYS_PLL3_DIV2,    IMXRT_CLK_SYS_PLL1_DIV5),
  SOURCES_COMMON(IMXRT_CLK_SYS_PLL3_DIV2,    IMXRT_CLK_SYS_PLL2_PFD3),
  SOURCES_COMMON(IMXRT_CLK_SYS_PLL3_DIV2,    IMXRT_CLK_SYS_PLL2_PFD3),
  SOURCES_COMMON(IMXRT_CLK_SYS_PLL3_DIV2,    IMXRT_CLK_SYS_PLL2_PFD3),
  SOURCES_COMMON(IMXRT_CLK_SYS_PLL3_DIV2,    IMXRT_CLK_SYS_PLL2_PFD3),
  SOURCES_COMMON(IMXRT_CLK_SYS_PLL3_DIV2,    IMXRT_CLK_SYS_PLL2_PFD3),
  SOURCES_COMMON(IMXRT_CLK_SYS_PLL3_DIV2,    IMXRT_CLK_SYS_PLL2_PFD3),
  SOURCES_COMMON(IMXRT_CLK_SYS_PLL3_DIV2,    IMXRT_CLK_SYS_PLL2_PFD3),
  SOURCES_COMMON(IMXRT_CLK_SYS_PLL3_DIV2,    IMXRT_CLK_SYS_PLL2_PFD3),
  SOURCES_COMMON(IMXRT_CLK_SYS_PLL3_DIV2,    IMXRT_CLK_SYS_PLL2_PFD3),
  SOURCES_COMMON(IMXRT_CLK_SYS_PLL3_DIV2,    IMXRT_CLK_SYS_PLL2_PFD3),
  SOURCES_COMMON(IMXRT_CLK_SYS_PLL3_PFD0,    IMXRT_CLK_SYS_PLL2_PFD0),
  SOURCES_COMMON(IMXRT_CLK_SYS_PLL3_PFD2,    IMXRT_CLK_SYS_PLL2_PFD1),
  SOURCES_COMMON(IMXRT_CLK_SYS_PLL2,         IMXRT_CLK_SYS_PLL1),
  SOURCES_COMMON(IMXRT_CLK_SYS_PLL3,         IMXRT_CLK_OSC24M),
  SOURCES_COMMON(IMXRT_CLK_SYS_PLL3,         IMXRT_CLK_OSC24M),
  SOURCES_COMMON(IMXRT_CLK_SYS_PLL3,         IMXRT_CLK_OSC24M),
  SOURCES_COMMON(IMXRT_CLK_SYS_PLL3_DIV2,    IMXRT_CLK_SYS_PLL2_PFD3),
  SOURCES_COMMON(IMXRT_CLK_SYS_PLL3_DIV2,    IMXRT_CLK_SYS_PLL2_PFD3),
  SOURCES_COMMON(IMXRT_CLK_SYS_PLL3_DIV2,    IMXRT_CLK_SYS_PLL2_PFD3),
  SOURCES_COMMON(IMXRT_CLK_SYS_PLL3_DIV2,    IMXRT_CLK_SYS_PLL2_PFD3),
  SOURCES_COMMON(IMXRT_CLK_SYS_PLL3_DIV2,    IMXRT_CLK_SYS_PLL2_PFD3),
  SOURCES_COMMON(IMXRT_CLK_SYS_PLL3_DIV2,    IMXRT_CLK_SYS_PLL2_PFD3),
  SOURCES_COMMON(IMXRT_CLK_SYS_PLL3_DIV2,    IMXRT_CLK_SYS_PLL2_PFD3),
  SOURCES_COMMON(IMXRT_CLK_SYS_PLL3_DIV2,    IMXRT_CLK_SYS_PLL2_PFD3),
  SOURCES_COMMON(IMXRT_CLK_SYS_PLL3_DIV2,    IMXRT_CLK_SYS_PLL2_PFD3),
  SOURCES_COMMON(IMXRT_CLK_SYS_PLL3_PFD1,    IMXRT_CLK_SYS_PLL2),
  SOURCES_COMMON(IMXRT_CLK_SYS_PLL3_PFD1,    IMXRT_CLK_SYS_PLL2),
  SOURCES_COMMON(IMXRT_CLK_SYS_PLL3_PFD1,    IMXRT_CLK_SYS_PLL2),
  SOURCES_COMMON(IMXRT_CLK_SYS_PLL3_DIV2,    IMXRT_CLK_SYS_PLL2_PFD3),
  SOURCES_COMMON(IMXRT_CLK_SYS_PLL3_DIV2,    IMXRT_CLK_SYS_PLL2_PFD3),
  SOURCES_COMMON(IMXRT_CLK_SYS_PLL2_PFD2,    IMXRT_CLK_SYS_PLL1_DIV5),
  SOURCES_COMMON(IMXRT_CLK_SYS_PLL2_PFD2,    IMXRT_CLK_SYS_PLL1_DIV5),
  SOURCES_COMMON(IMXRT_CLK_SYS_PLL1,         IMXRT_CLK_SYS_PLL2_PFD0),
  SOURCES_COMMON(IMXRT_CLK_SYS_PLL3_DIV2,    IMXRT_CLK_SYS_PLL2_PFD3),
  SOURCES_COMMON(IMXRT_CLK_SYS_PLL3_DIV2,    IMXRT_CLK_SYS_PLL2_PFD3),
  SOURCES_COMMON(IMXRT_CLK_SYS_PLL3,         IMXRT_CLK_SYS_PLL2_PFD3),
  SOURCES_COMMON(IMXRT_CLK_SYS_PLL1_DIV2,    IMXRT_CLK_SYS_PLL1_DIV5),
  SOURCES_COMMON(IMXRT_CLK_SYS_PLL1_DIV2,    IMXRT_CLK_SYS_PLL1_DIV5),
  SOURCES_COMMON(IMXRT_CLK_SYS_PLL3,         IMXRT_CLK_SYS_PLL2_PFD3),
  SOURCES_COMMON(IMXRT_CLK_SYS_PLL3_PFD3,    IMXRT_CLK_SYS_PLL2_PFD1),
  SOURCES_COMMON(IMXRT_CLK_SYS_PLL1_DIV2,    IMXRT_CLK_SYS_PLL1_DIV5),
  SOURCES_COMMON(IMXRT_CLK_SYS_PLL1_DIV2,    IMXRT_CLK_SYS_PLL1_DIV5),
  SOURCES_COMMON(IMXRT_CLK_SYS_PLL1_DIV2,    IMXRT_CLK_SYS_PLL1_DIV5),
  SOURCES_COMMON(IMXRT_CLK_SYS_PLL1_DIV2,    IMXRT_CLK_SYS_PLL1_DIV5),
  SOURCES_COMMON(IMXRT_CLK_SYS_PLL1_DIV2,    IMXRT_CLK_SYS_PLL1_DIV5),
  SOURCES_COMMON(IMXRT_CLK_SYS_PLL1_DIV2,    IMXRT_CLK_SYS_PLL1_DIV5),
  SOURCES_COMMON(IMXRT_CLK_SYS_PLL1_DIV2,    IMXRT_CLK_SYS_PLL1_DIV5),
  SOURCES_COMMON(IMXRT_CLK_SYS_PLL1_DIV2,    IMXRT_CLK_SYS_PLL1_DIV5),
  SOURCES_COMMON(IMXRT_CLK_SYS_PLL1,         IMXRT_CLK_AUDIO_PLL),
  SOURCES_COMMON(IMXRT_CLK_SYS_PLL1,         IMXRT_CLK_AUDIO_PLL),
  SOURCES_COMMON(IMXRT_CLK_SYS_PLL1,         IMXRT_CLK_AUDIO_PLL),
  SOURCES_COMMON(IMXRT_CLK_SYS_PLL3,         IMXRT_CLK_SYS_PLL3_PFD1),
  SOURCES_COMMON(IMXRT_CLK_OSC24M,           IMXRT_CLK_SYS_PLL3_DIV2),
  SOURCES_COMMON(IMXRT_CLK_SYS_PLL1_DIV5,    IMXRT_CLK_AUDIO_PLL),
  SOURCES_COMMON(IMXRT_CLK_AUDIO_PLL,        IMXRT_CLK_SYS_PLL3_PFD2),
  SOURCES_COMMON(IMXRT_CLK_AUDIO_PLL,        IMXRT_CLK_SYS_PLL3_PFD2),
  SOURCES_COMMON(IMXRT_CLK_AUDIO_PLL,        IMXRT_CLK_SYS_PLL3_PFD2),
  SOURCES_COMMON(IMXRT_CLK_AUDIO_PLL,        IMXRT_CLK_SYS_PLL3_PFD2),
  SOURCES_COMMON(IMXRT_CLK_AUDIO_PLL,        IMXRT_CLK_SYS_PLL3_PFD2),
  SOURCES_COMMON(IMXRT_CLK_SYS_PLL3,         IMXRT_CLK_AUDIO_PLL),
  SOURCES_COMMON(IMXRT_CLK_SYS_PLL3_DIV2,    IMXRT_CLK_AUDIO_PLL),
  SOURCES_COMMON(IMXRT_CLK_SYS_PLL3_DIV2,    IMXRT_CLK_SYS_PLL1_DIV2),
  SOURCES_COMMON(IMXRT_CLK_SYS_PLL1_DIV5,    IMXRT_CLK_ARM_PLL)
};

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Name: imxrt_clockroot_configure
 *
 * Description:
 *   Configure an RT118x clock root.  The hardware encodes divider N as N-1.
 *
 ****************************************************************************/

int imxrt_clockroot_configure(unsigned int root, unsigned int mux,
                              unsigned int divider, bool enable)
{
  uint32_t reg;

  if (root >= IMXRT_CCM_ROOT_COUNT || mux > 3 || divider == 0 ||
      divider > 256)
    {
      return -EINVAL;
    }

  reg = CCM_ROOT_DIV(divider) | CCM_ROOT_MUX(mux);
  if (!enable)
    {
      reg |= CCM_ROOT_OFF;
    }

  putreg32(reg, IMXRT_CCM_ROOT_CTRL(root));
  UP_MB();

  /* Complete the CM33 peripheral write before returning. */

