apache/nuttx/arch/arm/src/imxrt/imxrt118x_clockconfig.c
  reg = getreg32(IMXRT_CCM_ROOT_CTRL(root));
  if ((reg & CCM_ROOT_OFF) != 0)
    {
      return -ENODEV;
    }

  divider = ((reg & CCM_ROOT_DIV_MASK) >> CCM_ROOT_DIV_SHIFT) + 1;

  mux = (reg & CCM_ROOT_MUX_MASK) >> CCM_ROOT_MUX_SHIFT;
  source = imxrt_clocksource_frequency(g_clock_sources[root][mux]);
  if (source == 0)
    {
      return -ENODEV;
    }

  *frequency = source / divider;
  return OK;
}

/****************************************************************************
 * Name: imxrt_clockgate_configure
 *
 * Description:
 *   Enable or disable an RT118x LPCG.
 *
 ****************************************************************************/

void imxrt_clockgate_configure(unsigned int gate, bool enable)
{
  uint32_t reg;

  DEBUGASSERT(gate < IMXRT_CCM_LPCG_COUNT);

  reg = getreg32(IMXRT_CCM_LPCG_DIR(gate));
  if (enable)
    {
      reg |= CCM_LPCG_DIR_ON;
    }
  else
    {
      reg &= ~CCM_LPCG_DIR_ON;
    }

  putreg32(reg, IMXRT_CCM_LPCG_DIR(gate));
  UP_MB();

  /* Complete the CM33 peripheral write before returning. */

  (void)getreg32(IMXRT_CCM_LPCG_DIR(gate));
}

/****************************************************************************
 * Name: imxrt_periphclk_configure
 *
 * Description:
 *   Configure an RT118x peripheral clock through the common i.MX RT
 *   peripheral-clock interface.
 *
 ****************************************************************************/

void imxrt_periphclk_configure(unsigned int gate, unsigned int value)
{
  imxrt_clockgate_configure(gate, value != CCM_CG_OFF);
}

#ifdef CONFIG_IMXRT_NETC
/* SYS_PLL1 (Ethernet PLL) + NETC/MAC roots matching Zephyr FRDM RT1186. */

static int imxrt_syspll1_initialize(void)
{
  uintptr_t base = IMXRT_ETHERNET_PLL_BASE;
  unsigned int timeout;
  uint32_t ctrl;

  if (imxrt_pll_frequency(IMXRT_PLL_SYS1) != 0)
    {
      g_imxrt118x_clock_status |= IMXRT_CLOCK_STATUS_SYS_PLL1;
      return OK;
    }

  /* Bypass while programming the fractional bank. */

  putreg32(PLL_CTRL_BYPASS, IMXRT_PLL_CTRL_SET(base));
  modifyreg32(IMXRT_ANADIG_PLL_SYS1_CTRL, 0, PLL_SYS1_ENABLE);

  putreg32(IMXRT118X_SYSPLL1_NUMERATOR, IMXRT_PLL_NUM(base));
  putreg32(IMXRT118X_SYSPLL1_DENOMINATOR, IMXRT_PLL_DENOM(base));
  putreg32(PLL_CTRL_DIV_MASK, IMXRT_PLL_CTRL_CLR(base));
  putreg32(IMXRT118X_SYSPLL1_DIV & PLL_CTRL_DIV_MASK,
           IMXRT_PLL_CTRL_SET(base));
  putreg32(PLL_CTRL_REG_ENABLE, IMXRT_PLL_CTRL_SET(base));
  up_udelay(IMXRT118X_PLL_REG_DELAY_US);

  putreg32(PLL_CTRL_POWERUP | PLL_CTRL_HOLD_RING_OFF,
           IMXRT_PLL_CTRL_SET(base));
  up_udelay(IMXRT118X_PLL_HOLD_DELAY_US);
  putreg32(PLL_CTRL_HOLD_RING_OFF, IMXRT_PLL_CTRL_CLR(base));

  for (timeout = IMXRT118X_PLL_TIMEOUT; timeout > 0; timeout--)
    {
      ctrl = getreg32(IMXRT_ANADIG_PLL_SYS1_CTRL);
      if ((ctrl & PLL_SYS1_STABLE) != 0)
        {
          putreg32(PLL_CTRL_ENABLE, IMXRT_PLL_CTRL_SET(base));
          modifyreg32(IMXRT_ANADIG_PLL_SYS1_CTRL, PLL_SYS1_GATE,
                      PLL_SYS1_DIV2_ENABLE | PLL_SYS1_DIV5_ENABLE);
          putreg32(PLL_CTRL_BYPASS, IMXRT_PLL_CTRL_CLR(base));
          g_imxrt118x_clock_status |= IMXRT_CLOCK_STATUS_SYS_PLL1;
          return OK;
        }
    }

  return -ETIMEDOUT;
}

static int imxrt_syspll3_pfd3_initialize(void)
{
  uint32_t pfd;
  uint32_t stable;
  unsigned int timeout;
  unsigned int shift = PLL_PFD_FRAC_SHIFT(3);

  pfd = getreg32(IMXRT_ANADIG_PLL_SYS3_PFD);
  if (((pfd >> shift) & 0x3fu) == IMXRT118X_SYSPLL3_PFD3_FRAC &&
      (pfd & PLL_PFD_GATE(3)) == 0)
    {
      return OK;
    }

  stable = pfd & PLL_PFD_STABLE(3);
  pfd |= PLL_PFD_GATE(3);
  putreg32(pfd, IMXRT_ANADIG_PLL_SYS3_PFD);

  pfd &= ~PLL_PFD_FRAC_MASK(3);
  pfd |= PLL_PFD_FRAC(3, IMXRT118X_SYSPLL3_PFD3_FRAC);
  putreg32(pfd, IMXRT_ANADIG_PLL_SYS3_PFD);

  putreg32(getreg32(IMXRT_ANADIG_PLL_SYS3_UPDATE) ^ PLL_PFD_UPDATE(3),
           IMXRT_ANADIG_PLL_SYS3_UPDATE);

  pfd = getreg32(IMXRT_ANADIG_PLL_SYS3_PFD);
  pfd &= ~PLL_PFD_GATE(3);
  putreg32(pfd, IMXRT_ANADIG_PLL_SYS3_PFD);

  for (timeout = IMXRT118X_PLL_TIMEOUT; timeout > 0; timeout--)
    {
      if ((getreg32(IMXRT_ANADIG_PLL_SYS3_PFD) & PLL_PFD_STABLE(3)) !=
          stable)
        {
          return OK;
        }
    }

  return -ETIMEDOUT;
}

int imxrt_netc_clocks_configure(void)
{
  int ret;

  if ((g_imxrt118x_clock_status & IMXRT_CLOCK_STATUS_NETC) != 0)
    {
      return OK;
    }

  ret = imxrt_syspll1_initialize();
  if (ret < 0)
    {
      return ret;
    }

  ret = imxrt_syspll3_pfd3_initialize();
  if (ret < 0)
    {
      return ret;
    }

  /* Zephyr SoC: NETC = SYS_PLL3_PFD3 / 2 (= 240 MHz). */

  imxrt_clockroot_configure(CCM_CR_NETC, 2, 2, true);

  /* Zephyr FRDM: MAC0 RGMII 1G needs 125 MHz (SYS_PLL1_DIV2 / 4).
   * MAC2 uses the same source with /4 for switch port 2.
   */

  imxrt_clockroot_configure(CCM_CR_MAC0, 2, 4, true);
  imxrt_clockroot_configure(CCM_CR_MAC2, 2, 4, true);
  imxrt_clockgate_configure(CCM_CCGR_NETC, true);

  g_imxrt118x_clock_status |= IMXRT_CLOCK_STATUS_NETC;
  return OK;
}
#endif /* CONFIG_IMXRT_NETC */

/****************************************************************************
 * Name: imxrt_clockconfig
 *
 * Description:
 *   Configure the initial RT1180 clock roots used by NuttX.
 *
 ****************************************************************************/

void imxrt_clockconfig(void)
{
  int ret;

  g_imxrt118x_clock_status = 0;
  g_imxrt118x_clock_error = OK;
  imxrt_clockroot_configure(CCM_CR_LPUART0102, 0, 1, true);
  imxrt_clockgate_configure(CCM_CCGR_LPUART1, true);

  ret = imxrt_ele_prepare_clocks();
  if (ret < 0)
    {
      imxrt_clock_failure(ret);
    }

  ret = imxrt_syspll3_initialize();
  if (ret < 0)
    {
      imxrt_clock_failure(ret);
    }

  /* SYS_PLL3 is a fixed 480 MHz source.  Keep LPUART at 24 MHz and run the
   * Cortex-M33 at 240 MHz, matching the NXP RT118x reference clock tree.
   */

  imxrt_clockroot_configure(CCM_CR_LPUART0102, 2, 10, true);
  imxrt_clockroot_configure(CCM_CR_M33, 2, 2, true);

  g_imxrt118x_clock_status |= IMXRT_CLOCK_STATUS_ROOTS_CONFIGURED;
}
